devises-ex/app/views/books/edit.html.erb

SELECT "authors".* FROM "authors"
---
              <%= form.label :author_id, 'Author' %>
              <%= form.collection_select :author_id, Author.all, :id, :name, {}, { class: 'form-control' } %>