devises-ex/app/views/books/new.html.erb

SELECT "authors".* FROM "authors"
---
              <%= form.label :author_id, 'Author' %>
              <%= form.collection_select :author_id, Author.all, :id, :name, { prompt: true }, { class: 'form-control' } %>