devises-ex/app/views/books/show.html.erb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 ORDER BY "authors"."id" ASC LIMIT $2  [["id", 22], ["LIMIT", 1]]
---
          </p>
          <% if @book.author.present? %>