devises-ex/app/controllers/authors_controller.rb

INSERT INTO "authors" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create_authors
    @author = Author.new(author_params)

    if @author.save

UPDATE "authors" SET "email" = $1, "updated_at" = $2, "name" = $3 WHERE "authors"."id" = $4  [["email", "test1020@gmail.com"], ["updated_at", "2023-10-21 15:44:12.198196"], ["name", "test1020"], ["id", 25]]
---
  def update_authors
    # binding.break
    if @author.update(author_params)

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
  def set_author
    @author = Author.find(params[:author_id])