devises-ex/app/controllers/books_controller.rb

SELECT "authors"."name", "authors"."id" FROM "authors"
---
  def index
    @filterrific = initialize_filterrific(
      Book,
      params[:filterrific],
      select_options: {
        sorted_by: Book.options_for_sorted_by,
        with_author_id: Author.pluck(:name, :id)
      },
      persistence_id: false, # Disables session persistence
      available_filters: [:sorted_by, :search_query, :with_author_id, :with_release_date_gte]
    ) || return

INSERT INTO "books" ("name", "release_date", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "testbook"], ["release_date", "2019-03-03"], ["author_id", 16], ["created_at", "2023-10-21 15:38:24.201211"], ["updated_at", "2023-10-21 15:38:24.201211"]]
---
  def create
    @book = Book.new(book_params)

    if @book.save

UPDATE "books" SET "release_date" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["release_date", "2021-01-01"], ["updated_at", "2023-10-21 15:41:53.780877"], ["id", 54]]
---
  def update
    if @book.update(book_params)