devises-ex/app/models/author.rb

SELECT "authors".* FROM "authors"
---
  def self.to_csv
    attributes = %w{name email} # add other attributes here if needed

    CSV.generate(headers: true) do |csv|
      csv << attributes

      all.each do |author|